---
kind: method
id: M:Autodesk.Revit.DB.Electrical.VoltageTypeSet.ReverseIterator
source: html/2d4fd44c-068a-2d57-2ce0-557260285aae.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual VoltageTypeSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.